app/Helpers/identity_helper.php

SELECT *
FROM `tb_identity`
WHERE `deleted_at` = 0
---
    function identity()
    {
        $db      = \Config\Database::connect();
        $data    = $db->table('tb_identity')->select('*')->where('deleted_at', 0)->get()->getRowArray();